In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("GROUP_OF_DATASETS/SWEETS.csv")

In [3]:
df.head()

,Unnamed: 0,Unnamed: 0.1,date,ishol/week,group,name,quantity,unit_cogs,monthly_Avgtemp,monthly_avg_FeelsLikeC,monthly_avg_HeatIndexC,monthly_avg_cloudcover,monthly_avg_humidity
0,1495,1495,2018-01-01,9,SWEETS,AMELIA PIANKA 380 G SMIET.CZEK,2.0,4.180000,-0.42,-4.84,1,2,82.81
1,1496,1496,2018-01-01,9,SWEETS,ANDRUTY FURMANIAK,97.0,0.699381,-0.42,-4.84,1,2,82.81
2,1497,1497,2018-01-01,9,SWEETS,ANIMALS MODEL,1.0,5.680000,-0.42,-4.84,1,2,82.81
3,1498,1498,2018-01-01,9,SWEETS,BATON 7DAYS KAKAO W POLEWIE,3.0,0.550000,-0.42,-4.84,1,2,82.81
4,1499,1499,2018-01-01,9,SWEETS,BATON BOUNTY 57G,12.0,1.490000,-0.42,-4.84,1,2,82.81

In [5]:
test=df["name"].unique()

In [6]:
test=pd.DataFrame(test)

In [7]:
type(test)

pandas.core.frame.DataFrame

In [8]:
test.head()

                                0
0  AMELIA PIANKA 380 G SMIET.CZEK
1             ANDRUTY   FURMANIAK
2                   ANIMALS MODEL
3     BATON 7DAYS KAKAO W POLEWIE
4                BATON BOUNTY 57G